#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-bQ1kw5ruzroGLHyG

Waiting for the plan to start...

Terraform v0.12.29
Configuring remote state backend...
Initializing Terraform configuration...
2020/08/03 08:07:48 [DEBUG] Using modified User-Agent: Terraform/0.12.29 TFC/3ad8313ada
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.data.external.env_override: Refreshing state...
module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.data.external.env_override: Refreshing state...
module.gke.module.primary-cluster.random_string.cluster_service_account_suffix: Refreshing state... [id=rqol]
module.gke.module.primary-cluster.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.data.google_container_engine_versions.region: Refreshing state...
module.gke.module.primary-cluster-networking.module.vpc.google_compute_network.network: Refreshing state... [id=projects/test-terraform-project-01/global/networks/test-template-1-network]
module.gke.module.primary-cluster.data.google_compute_zones.available: Refreshing state...
module.gke.data.google_client_openid_userinfo.terraform_user: Refreshing state...
module.gke.module.primary-cluster.data.google_client_config.default: Refreshing state...
module.gke.module.primary_cluster_auth.data.google_client_config.provider: Refreshing state...
module.gke.data.google_client_config.client: Refreshing state...
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-gcr[0]: Refreshing state... [id=test-terraform-project-01/roles/storage.objectViewer/serviceaccount:tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/logging.logWriter/serviceaccount:tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.module.primary-cluster.data.google_container_engine_versions.zone: Refreshing state...
module.gke.module.primary-cluster-networking.module.subnets.google_compute_subnetwork.subnetwork["asia-southeast2/test-template-1-subnet-01"]: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/subnetworks/test-template-1-subnet-01]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.metricWriter/serviceaccount:tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.viewer/serviceaccount:tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=test-terraform-project-01/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-test-template-1-rqol@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"]: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1/nodePools/pool-01]
module.gke.data.google_container_cluster.current_cluster: Refreshing state...
module.gke.module.primary_cluster_auth.data.google_container_cluster.gke_cluster: Refreshing state...
module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0]: Refreshing state... [id=3405347174799113535]
module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=3177609153295409159]
module.gke.module.primary_cluster_auth.data.template_file.kubeconfig: Refreshing state...
module.gke.null_resource.setup_gcloud_cli: Refreshing state... [id=6124763060766640437]
module.gke.null_resource.download_kubectl: Refreshing state... [id=5002135959202277995]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.helm_release.jaeger will be created
  + resource "helm_release" "jaeger" {
      + atomic                     = false
      + chart                      = "jaeger-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "jaeger"
      + namespace                  = "observability"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jaegertracing.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.15.1"
      + wait                       = true
    }

  # module.gke.kubernetes_namespace.observability will be created
  + resource "kubernetes_namespace" "observability" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "observability"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gke.null_resource.configure_kubectl will be created
  + resource "null_resource" "configure_kubectl" {
      + id = (known after apply)
    }

  # module.gke.null_resource.download_kubectl is tainted, so must be replaced
-/+ resource "null_resource" "download_kubectl" {
      ~ id = "5002135959202277995" -> (known after apply)
    }

  # module.gke.null_resource.install_Elastic_operator will be created
  + resource "null_resource" "install_Elastic_operator" {
      + id = (known after apply)
    }

  # module.gke.null_resource.install_Elastic_resources will be created
  + resource "null_resource" "install_Elastic_resources" {
      + id = (known after apply)
    }

  # module.gke.null_resource.install_IstioOperator_manifest will be created
  + resource "null_resource" "install_IstioOperator_manifest" {
      + id = (known after apply)
    }

  # module.gke.null_resource.install_istio_operator will be created
  + resource "null_resource" "install_istio_operator" {
      + id = (known after apply)
    }

  # module.gke.null_resource.set_kiali_credentials will be created
  + resource "null_resource" "set_kiali_credentials" {
      + id = (known after apply)
    }

Plan: 9 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*